<details>
<summary>Terraform Plan</summary>

```
module.secret_pgp_signing_key_passphrase.github_actions_organization_secret.this: Refreshing state... [id=PGP_SIGNING_KEY_PASSPHRASE]
module.repository_br_cluster_manifests.github_repository.this: Refreshing state... [id=br-cluster-manifests]
module.team_br_owners.github_team.this: Refreshing state... [id=16651818]
module.secret_sonatype_central_username.github_actions_organization_secret.this: Refreshing state... [id=SONATYPE_CENTRAL_USERNAME]
module.repository_aws_shortcut_generator.github_repository.this: Refreshing state... [id=aws-shortcut-generator]
module.repository_br_cluster_provisioner.github_repository.this: Refreshing state... [id=br-cluster-provisioner]
module.member_kukv.github_membership.this: Refreshing state... [id=bright-room:kukv]
module.repository_br_cluster_imager.github_repository.this: Refreshing state... [id=br-cluster-imager]
module.repository_idem.github_repository.this: Refreshing state... [id=idem]
module.repository_organization_structure.github_repository.this: Refreshing state... [id=organization-structure]
module.secret_sonatype_central_password.github_actions_organization_secret.this: Refreshing state... [id=SONATYPE_CENTRAL_PASSWORD]
module.member_br_github_manager.github_membership.this: Refreshing state... [id=bright-room:br-github-manager]
module.secret_tf_api_token.github_actions_organization_secret.this: Refreshing state... [id=TF_API_TOKEN]
module.repository_endpoint_gate.github_repository.this: Refreshing state... [id=endpoint-gate]
module.secret_pgp_signing_key.github_actions_organization_secret.this: Refreshing state... [id=PGP_SIGNING_KEY]
module.secret_auth_token.github_actions_organization_secret.this: Refreshing state... [id=AUTH_TOKEN]
module.repository_br_cluster_manifests.github_issue_labels.this: Refreshing state... [id=br-cluster-manifests]
module.team_br_owners.github_organization_role_team.this["8136"]: Refreshing state... [id=8136:br-owners]
module.team_br_owners.github_team_membership.this["kukv"]: Refreshing state... [id=16651818:kukv]
module.team_br_owners.github_team_membership.this["br-github-manager"]: Refreshing state... [id=16651818:br-github-manager]
module.repository_br_cluster_provisioner.github_issue_labels.this: Refreshing state... [id=br-cluster-provisioner]
module.repository_aws_shortcut_generator.github_issue_labels.this: Refreshing state... [id=aws-shortcut-generator]
module.repository_br_cluster_imager.github_issue_labels.this: Refreshing state... [id=br-cluster-imager]
module.repository_idem.github_issue_labels.this: Refreshing state... [id=idem]
module.repository_organization_structure.github_issue_labels.this: Refreshing state... [id=organization-structure]
module.repository_idem.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903152]
module.repository_organization_structure.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13902862]
module.repository_aws_shortcut_generator.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903148]
module.repository_br_cluster_manifests.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903149]
module.repository_br_cluster_provisioner.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903151]
module.repository_br_cluster_imager.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903150]
module.repository_idem.github_repository_ruleset.this["protect-tags"]: Refreshing state... [id=13904426]
module.repository_idem.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:idem]
module.repository_br_cluster_manifests.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:br-cluster-manifests]
module.repository_br_cluster_imager.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:br-cluster-imager]
module.repository_br_cluster_provisioner.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:br-cluster-provisioner]
module.repository_aws_shortcut_generator.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:aws-shortcut-generator]
module.repository_endpoint_gate.github_issue_labels.this: Refreshing state... [id=endpoint-gate]
module.repository_endpoint_gate.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13903147]
module.repository_endpoint_gate.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:endpoint-gate]
module.repository_organization_structure.github_team_repository.this["16651818"]: Refreshing state... [id=16651818:organization-structure]
module.repository_organization_structure.github_actions_organization_secret_repository.this["AUTH_TOKEN"]: Refreshing state... [id=AUTH_TOKEN:1181337329]
module.repository_organization_structure.github_actions_organization_secret_repository.this["TF_API_TOKEN"]: Refreshing state... [id=TF_API_TOKEN:1181337329]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["SONATYPE_CENTRAL_PASSWORD"]: Refreshing state... [id=SONATYPE_CENTRAL_PASSWORD:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["SONATYPE_CENTRAL_USERNAME"]: Refreshing state... [id=SONATYPE_CENTRAL_USERNAME:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["PGP_SIGNING_KEY_PASSPHRASE"]: Refreshing state... [id=PGP_SIGNING_KEY_PASSPHRASE:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["PGP_SIGNING_KEY"]: Refreshing state... [id=PGP_SIGNING_KEY:1175625101]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.team_br_contributors.github_organization_role_team.this["8134"] will be created
  + resource "github_organization_role_team" "this" {
      + id        = (known after apply)
      + role_id   = 8134
      + team_slug = (known after apply)
    }

  # module.team_br_contributors.github_team.this will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Organization Developers who also serve as repository contributors"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "br-contributors"
      + node_id                   = (known after apply)
      + notification_setting      = "notifications_enabled"
      + parent_team_id            = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.team_br_developers.github_team.this will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Organization developers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "br-developers"
      + node_id                   = (known after apply)
      + notification_setting      = "notifications_enabled"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # module.team_br_maintainers.github_organization_role_team.this["8135"] will be created
  + resource "github_organization_role_team" "this" {
      + id        = (known after apply)
      + role_id   = 8135
      + team_slug = (known after apply)
    }

  # module.team_br_maintainers.github_team.this will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Organization developers who also serve as repository maintainers."
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "br-maintainers"
      + node_id                   = (known after apply)
      + notification_setting      = "notifications_enabled"
      + parent_team_id            = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Deprecated attribute

  on modules/organization_secret/main.tf line 7, in resource "github_actions_organization_secret" "this":
   7:     ignore_changes = [plaintext_value, encrypted_value, selected_repository_ids]

The attribute "selected_repository_ids" is deprecated. Refer to the provider
documentation for details.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>